{"backend": "tensorflow", "config": {"layers": [{"config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "filters": 32, "name": "conv2d_1", "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "dtype": "float32", "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "filters": 32, "name": "conv2d_2", "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"units": 128, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"units": 9, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "kernel_constraint": null, "activation": "softmax", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4"}