{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"use_bias": true, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "batch_input_shape": [null, 64, 64, 3], "kernel_constraint": null, "filters": 32, "dtype": "float32", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"use_bias": true, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 32, "padding": "valid", "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 128, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 9, "use_bias": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax"}}]}, "backend": "tensorflow"}