{"config": {"name": "sequential_1", "layers": [{"config": {"use_bias": true, "trainable": true, "strides": [1, 1], "filters": 32, "kernel_constraint": null, "activation": "relu", "batch_input_shape": [null, 64, 64, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "dtype": "float32", "padding": "valid", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 32, "kernel_constraint": null, "activation": "relu", "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "trainable": true, "kernel_constraint": null, "activation": "relu", "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "trainable": true, "kernel_constraint": null, "activation": "softmax", "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 9, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}