{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"data_format": "channels_last", "activation": "relu", "batch_input_shape": [null, 64, 64, 3], "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_1", "dtype": "float32", "use_bias": true, "bias_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "units": 512, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "units": 9, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}