{"keras_version": "2.2.4", "config": {"layers": [{"config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "kernel_size": [3, 3], "dtype": "float32", "padding": "valid", "kernel_constraint": null, "name": "conv2d_1", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 32, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "padding": "valid", "use_bias": true, "filters": 32, "kernel_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 512, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 9, "activation": "softmax"}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential"}