{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1], "activation": "relu", "filters": 32, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 64, 64, 3], "name": "conv2d_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "filters": 32, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 9, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}