{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"name": "conv2d_1", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "dtype": "float32", "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "batch_input_shape": [null, 64, 64, 3], "padding": "valid", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [3, 3], "padding": "valid", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "units": 512, "trainable": true, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dense_2", "units": 9, "trainable": true, "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}