{"config": {"name": "sequential_1", "layers": [{"config": {"strides": [1, 1], "name": "conv2d_1", "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "batch_input_shape": [null, 64, 64, 3], "data_format": "channels_last", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "name": "conv2d_2", "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 9, "activity_regularizer": null, "activation": "softmax", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}