{"config": {"name": "sequential_1", "layers": [{"config": {"use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "strides": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "kernel_size": [3, 3], "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "name": "conv2d_2", "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "strides": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 128, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "dense_1", "bias_regularizer": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"units": 9, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "softmax", "name": "dense_2", "bias_regularizer": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}