{"keras_version": "2.2.4", "config": {"layers": [{"config": {"dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "strides": [1, 1], "filters": 32, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 64, 64, 3], "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "name": "conv2d_2", "kernel_regularizer": null, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 512, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "kernel_regularizer": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 9, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow"}