{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_1", "dtype": "float32", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "activation": "relu", "data_format": "channels_last", "filters": 32, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_2", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activation": "relu", "name": "dense_1", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9, "activation": "softmax", "name": "dense_2", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}}]}, "backend": "tensorflow"}