{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"bias_constraint": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "batch_input_shape": [null, 64, 64, 3], "kernel_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "filters": 32, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 32, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "units": 128, "activation": "relu", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "units": 9, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}