{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"filters": 32, "kernel_constraint": null, "activation": "relu", "dtype": "float32", "trainable": true, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 64, 64, 3], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"filters": 32, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 512, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 9, "name": "dense_2", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}